---
kind: method
id: M:Autodesk.Revit.DB.BasicFileInfo.Dispose
source: html/ea844cc5-ff80-ffc9-2740-1482aca86418.htm
---
# Autodesk.Revit.DB.BasicFileInfo.Dispose Method

Releases all resources used by the BasicFileInfo

## Syntax (C#)
```csharp
public void Dispose()
```